M = 0.2;
m = 0.1;
l = 0.5; %расстояние до центра масс
I = (m * l^2)/3
g = 9.8;

% Уравнения Лагранжа
% T1 = M*(x')^2/2
% T2 = m*vc^2/2 + I*(ф')^2/2
% vc = (x'^2 + 2*lxф*cosф + l^2*ф')
% T =T1+T2 = (M+m)(x')^2/2 + mlx'ф'cosф +ml^2/2*ф^2 + I*(ф')^2
% Преобразуем:
% (M+m)x" + mlф"cosф - ml(ф')^2sinф = u | u = F -сила, действующая на маятник
% (I + ml^2)*ф" + mlx"*cosф = - mgl*sinф

%Линеризация:
% sinф = ф
% cosф = 1
% ml(ф')^2sinф = 0
%
% (M+m)x" + mlф" = u
% (I + ml^2)*ф" + mlx" = - mgl*ф
%
% x"  = -ml/(M+m)*ф" + u/(M+m)
% ф"  = - mgl/(I + ml^2)*ф  -ml/(I + ml^2)*x"
%
% ф" = - mgl*ф - ml/(I + ml^2)*(-ml/(M+m)*ф" + u/(M+m))
% ф" (1 - ml/(I + ml^2)*(ml/(M+m)))= ф" * (I*(M+m)+M*m*l^2)/((M+m)*(I + ml^2)))


p = I*(M+m)+M*m*l^2; 

% ф" = -mgl(M+m)/p*ф  - ml/p*u
% x" = (m^2*g*l^2)/p*ф + (I+m*l^2)/p 
% x1 = x
% x2 = x'
% x3 = ф
% x4 = ф'

A = [0      1              0           0;...
     0      0          (m^2*g*l^2)/p   0;...
     0      0              0           1;...
     0      0          -m*g*l*(M+m)/p  0]
B = [     0;
     (I+m*l^2)/p;
          0;
       -m*l/p]


%      0 1 0 0 ;...
%      0 0 C33 0 ;...
%      0 0 1 0 ;...
%      0 0 0 1 ;...
%      0 0 C63 0]
% D = [0 ;...
%      0 ;...
%      D3 ;...
%      0 ;...
%      0 ;...
%      D6 ]

Init_St = [ 0 0 deg2rad(5) 0] %Начальные состояния 